/* 
Створити систему ротінгу з можливістю змінювати роль.
Ролі:
 - admin
 - user
 - guest
На головній сторінці - кнопки з назвами ролей. 
По кліку на кожну з ролей - зʼявляється список посилань зі сторінками які доступні тільки цій ролі.

Список сторінок для ролі admin:
  Home - "/"
  Products - "/products"
  Users - "/users"
  Sessions - "/sessions"

Список сторінок для ролі user:
  Home - "/"
  Products - "/products"
  Product - "/products/:id"

Список сторінок для ролі guest:
  Home - "/" 
*/
